#  sort() метод:

# Використовується для сортування списку (або інших ітерабельних об'єктів) на місці, тобто змінює сам об'єкт, на якому викликається.
# Не повертає нового списку; змінює існуючий.
# Використовується як метод списку:
# python

my_list = [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
my_list.sort()
print(my_list)  # [1, 1, 2, 3, 3, 4, 5, 5, 5, 6, 9]


#  sorted() функція:

# Повертає новий відсортований список (або інший ітерабельний об'єкт), не змінюючи оригінальний об'єкт.
# Сортує будь-який ітерабельний об'єкт та повертає новий список:
# python

new_list = [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
new_sorted_list = sorted(new_list)
print(new_sorted_list)  # [1, 1, 2, 3, 3, 4, 5, 5, 5, 6, 9] завжди повертає список

c = sorted(new_list, reverse = True)
print(c)  # [9, 6, 5, 5, 5, 4, 3, 3, 2, 1, 1]

# Отже, головна різниця полягає в тому, що sort() змінює оригінальний список, тоді як sorted() повертає новий відсортований список, не змінюючи оригінальний.