# Функція генератор

#  yield - це ключове слово в мові програмування Python, яке використовується для створення генераторів. 
#  Генератор - це спеціальний вид функції, яка може призупиняти своє виконання, повертати значення та потім продовжувати виконання з того місця, де вона була призупинена.
#  Основна ідея yield полягає в тому, щоб можна було створити генератор, який генерує послідовність значень, але не зберігає їх у пам'яті цілком, а отримує або генерує значення по одному за потребою.

def my_generator():
    for i in range(5):
        yield i

gen = my_generator()

for value in gen:
    print(value)

#  У цьому прикладі функція my_generator використовує yield для повернення значень в ітераторі. 
#  Кожен раз, коли викликається yield, виконання функції зупиняється, і значення передається назовні. 
#  Потім, при наступному виклику генератора, виконання відновлюється з того самого місця, де було припинено.
#  Важливо розуміти, що генератори дозволяють працювати з послідовністю значень без необхідності зберігання всіх цих значень у пам'яті, що є корисним у випадках з великими обсягами даних або нескінченними послідовностями.


def new():
    return [1, 2, 3]

print(new())

def func_gen():
    for i in [1, 2, 3]:
        yield i

result = func_gen()
print(result)  # <generator object func_gen at 0x7fba7cb426c0>
print(next(result))  # 1
print(next(result))  # 2
print(next(result))  # 3
#print(next(result))  # StopIteration

for i in func_gen():
    print(i)

#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>yield - повертає значення і заморожує функцію зі всіма локальними елементами<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
    
def genf():
    s = 7
    for i in [43, 65, 32]:
        yield i
        print(s)
        s = s * 10 + 7

g = genf()
print(next(g))
print(next(g))
print(next(g))