#  Кортежі (tuple):
my_tuple = (1, 2, 3)
# Неможливо змінити значення, додати чи видалити елемент


#  Рядки (str):
my_string = "Hello"
#  Неможливо змінити символи рядка


#  Не змінні множини (frozenset):
my_frozenset = frozenset({1, 2, 3})
# Неможливо додати або видалити елементи після створення


#  Логічні значення (bool):
my_bool = True
#  Неможливо змінити значення булевого типу


#  Числові типи:
#  int, float, complex: Ці числові типи даних є немутабельними. Наприклад:
my_int = 42
#  Неможливо змінити значення my_int після створення


#  Замовчування (NoneType):
#  Тип NoneType, представлений значенням None, є немутабельним.
my_none = None
#  Неможливо змінити значення my_none після створення


#  Enumerations (enum.Enum):
#  Тип даних, представлений класом перерахування (enum), також є немутабельним.
from enum import Enum

class Color(Enum):
    RED = 1
    GREEN = 2
    BLUE = 3
#  Неможливо змінити значення перерахувань після створення


# Слайди (slice):
# Тип даних, який використовується для створення зрізів послідовностей, також є немутабельним.
    my_slice = slice(0, 3)
# Неможливо змінити значення my_slice після створення


# Комплексні числа (complex):
# Комплексні числа є немутабельними, і їх частини (real та imag) не можна змінювати.
    my_complex = complex(1, 2)
# Неможливо змінити реальну чи уявну частину після створення
