#  Мутабельність в Python вказує на можливість зміни об'єкта після його створення. Якщо об'єкт мутабельний, значить, 
#  його стан можна змінювати, додавати або видаляти елементи, тобто це "змінюваний" об'єкт.
#  Ось кілька типів даних в Python та їхня мутабельність:

#  Списки (list):
my_list = [1, 2, 3]
my_list[0] = 10  # Змінюємо перший елемент
my_list.append(4)  # Додаємо новий елемент
del my_list[1]  # Видаляємо другий елемент

#  Словники (dict):
my_dict = {'a': 1, 'b': 2, 'c': 3}
my_dict['a'] = 10  # Змінюємо значення за ключем 'a'
my_dict['d'] = 4  # Додаємо нову пару ключ-значення
del my_dict['b']  # Видаляємо ключ 'b' та його значення
 
#  Множини (set):
my_set = {1, 2, 3}
my_set.add(4)  # Додаємо новий елемент
my_set.remove(2)  # Видаляємо елемент

#  Байтові масиви (bytearray):
my_bytearray = bytearray(b'hello')
my_bytearray[0] = 72  # Змінюємо перший байт на код символу 'H'

#  Черги (queue):
from queue import Queue
my_queue = Queue()
my_queue.put(1)  # Можна додати елемент в чергу
item = my_queue.get()  # Можна витягнути елемент з черги
