class Cat1:
    __shared_attr = {         # змінний атрибут
        'breed': 'pers',
        'color': 'black'
    }

    def __init__(self):
        self.__dict__ = Cat1.__shared_attr # У кожного екземпляра класу в якості змінної __dict__ зберігається посилання на словар, відповідно всі об'єкти 
                                           # будуть мати посилання на один і той самий словар. Якщо один об'єкт змінює словар то й ці зміни будуть стосуватися
                                           # всіх інших екземлярів класу.


d = Cat1()
g = Cat1()

print(d.__dict__)  # {'breed': 'pers', 'color': 'black'}
print(g.__dict__) 

# Так стається за допомогою одного атрибута класа __shared_attr який є словарем, а він у свою чергу є змінним.


