# Атрибут екземпляра класа
#Екземпляр класу в Python - це конкретний об'єкт, створений на основі певного класу

class Car:
    model = 'BMW'
    engine = 1.6

#print(Car())  # Результат виклику класа є екземляром класу який можна поставити у змінну

a1 = Car() # а1 є екземляром класу
a2 = Car() # а2 є екземляром класу
a3 = Car() # а3 є екземляром класу


print(a1)     # <__main__.Car object at 0x7f3e4955a830>
print(a2)     # <__main__.Car object at 0x7f3e4955aa10>

#print(Car.__dict__)
print(a1.model)  # BMW
print(a1.__dict__)  # {} # Пусті атрибути

a1.seat = 4
print(a1.__dict__)  # {'seat': 4}
print(Car.__dict__)  # Тут атрибута {'seat': 4} вже немає.
print(a2.__dict__)  # {}

a1.model = 'Audi'
print(a1.model)  # Audi
print(a1.__dict__)  # {'seat': 4, 'model': 'Audi'}
print(a2.model)  # BMW

#↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
# Кожен екземпляр класу є простіром імен. Наприклад: a1 має два атрибути всередині цього простіру імен, це {'seat': 4, 'model': 'Audi'}, а також клас Car
# який має свої атрибути. Деякі атрибути по іменам можуть співпадати. 
#↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑

a2.size = 80
print(a2.size)

#СТВОРНИЙ АТРИБУТ ВСЕРЕДИНІ ЕКЗЕМПЛЯРА КЛАСУ НІЯК НЕ ВПЛИВАЄ НА АТРИБУТИ ВСЕРЕДИНІ КЛАСА!!!!!!!!!!!!!!!!!!!!

Car.r = 777  # Атрибут 777 який знаходить в класі Car є доступним всім екземлярам класу Car


#####################################################################################################################################################
class New_class():
    a = 1
    b = 2

asd = New_class()
asd.a = 11
asd.x = 3

print(New_class.a)
print(asd.a)

print(New_class.__dict__)
print(asd.__dict__)

print(asd.b)
print(New_class.b)

del asd.a
print(asd.a)