from pathlib import Path

print(Path('.').absolute())  # /home/volodymyr/git/My_way_to_Junior
# print(type(Path))  # <class 'module'>

# file_path = Path('222.txt')
# print([i for i in dir(file_path) if not i.startswith('_')])


print(Path.cwd())  # cwd - current working directory

#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# 1. Path('.').absolute():                                                                                             <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#    Path('.') представляє шлях до поточної директорії.                                                                <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#    absolute() перетворює цей шлях в абсолютний (повний) шлях.                                                        <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# 2. Path.cwd():                                                                                                       <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#    Path.cwd() відразу повертає абсолютний шлях до поточної робочої директорії, не потребуючи використання absolute() <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
#<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

path = Path('usr').joinpath('local').joinpath('bin')  # створює об'єкт шляху, який представляє шлях до директорії "usr/local/bin". 
                                                      # Це корисний метод для конструювання шляхів у вашому коді.
print(Path('usr') / 'local' / 'bin')  # Аналогія вище

print(path)  # usr/local/bin  Це виглядає як шлях до директорії "usr/local/bin", 
             # який може бути використаний у вашому коді для подальшої обробки файлів чи директорій у цій локації.

# Як провірити чи є певна директорія чи файл на комп'ютері? Метод exist()
print(Path('main.py').exists())  # Можна вказувати як відносний шлях до файлу так і абсолютний

# Як провірити, директорія чи файл?
print(Path('main.py').is_file())              # True
print(Path('../My_way_to_Junior').is_file())  # False
print(Path('../My_way_to_Junior').is_dir())   # True

# Як подивитися які директорії та файли є в певній директорії?
for f in Path('.').iterdir():
    print(f)











