# Винятки компіляції - це помилки, які виникають під час компіляції програми, а не під час її виконання. 
# У Python, коли ви запускаєте програму, спочатку вона компілюється у байт-код, а потім виконується інтерпретатором. 
# Якщо виникають помилки під час компіляції, вони зазвичай пов'язані зі синтаксичними помилками, 
# невірним використанням ключових слів або інших проблемами зі схемою кодування. 
# У випадку помилок компіляції Python видасть повідомлення про помилку з описом проблеми та місцем її виникнення в коді програми.

print('hello1')  # hello1
print('hello2')  # hello2
print('hello3')  # hello3
int('hello')
print('hello4')
print('hello5')
print('hello6')

